src/Documents/ПриостановкаРаботыСтанции/ПриостановкаРаботыСтанции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриостановкаРаботыСтанции</name>
  <registerRecords>InformationRegister.СтатусСтанций</registerRecords>
  <registerRecords>InformationRegister.СостояниеНоменклатуры</registerRecords>
  <attributes>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОстановки</name>
    <type>
      <types>EnumRef.СтатусыСтанций</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/СтатусСтанций/СтатусСтанций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусСтанций</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыСтанций</types>
    </type>
  </resources>
  <dimensions>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостояниеНоменклатуры/СостояниеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеНоменклатуры</name>
  <comment>Описывает все возможные состояния номенклатуры</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Арендатор</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </resources>
  <resources>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеЭксплуатации</name>
    <comment>Пустая ссылка - все нормально, иначе см. основание</comment>
    <type>
      <types>EnumRef.ОснованияВыводаТовараИзЭксплуатации</types>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ОснованияВыводаТовараИзЭксплуатации/ОснованияВыводаТовараИзЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОснованияВыводаТовараИзЭксплуатации</name>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>Ремонт</name>
  </enumValues>
  <enumValues>
    <name>ПрофилактическиеРаботы</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ВыводИзЭксплуатации/ВыводИзЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыводИзЭксплуатации</name>
  <registerRecords>InformationRegister.СостояниеНоменклатуры</registerRecords>
  <attributes>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>EnumRef.ОснованияВыводаТовараИзЭксплуатации</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПриостановкаРаботыСтанции/ObjectModule.bsl
// @strict-types

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.СтатусСтанций.Записывать = Истина;
	Движение = Движения.СтатусСтанций.Добавить();
	Движение.Период = Дата;
	Движение.Станция = Станция;
	Движение.Состояние = ПричинаОстановки;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостояниеНоменклатурыСрезПоследних.Товар
	|ИЗ
	|	РегистрСведений.СостояниеНоменклатуры.СрезПоследних(&Период,) КАК СостояниеНоменклатурыСрезПоследних
	|ГДЕ
	|	СостояниеНоменклатурыСрезПоследних.Станция = &Станция";

	Запрос.УстановитьПараметр("Станция", Станция);
	Запрос.УстановитьПараметр("Период", Дата);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Попытка
		НачатьТранзакцию();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Документ = Документы.ВыводИзЭксплуатации.СоздатьДокумент();
			Товар = ВыборкаДетальныеЗаписи.Товар; // СправочникСсылка.Номенклатура -
			Документ.Товар = Товар;
			Документ.Основание = Перечисления.ОснованияВыводаТовараИзЭксплуатации.ПрофилактическиеРаботы;
			Документ.Дата = Дата;
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры
